Model: "nn_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
actor_model (ActorModel)     multiple                  6991437   
_________________________________________________________________
critic_model (CriticModel)   multiple                  8789183   
=================================================================
Total params: 15,780,620
Trainable params: 15,780,620
Non-trainable params: 0
_________________________________________________________________
Model: "actor_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  666       
_________________________________________________________________
dense_1 (Dense)              multiple                  1116      
_________________________________________________________________
dense_2 (Dense)              multiple                  171       
_________________________________________________________________
dense_3 (Dense)              multiple                  10        
_________________________________________________________________
unit_vector_layer (UnitVecto multiple                  0         
_________________________________________________________________
concatenate (Concatenate)    multiple                  0         
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
cnn (CNN)                    multiple                  6735444   
_________________________________________________________________
cnn_1 (CNN)                  multiple                  240600    
_________________________________________________________________
cnn_2 (CNN)                  multiple                  7260      
_________________________________________________________________
cnn_3 (CNN)                  multiple                  4944      
_________________________________________________________________
cnn_4 (CNN)                  multiple                  1176      
_________________________________________________________________
cnn_5 (CNN)                  multiple                  50        
=================================================================
Total params: 6,991,437
Trainable params: 6,991,437
Non-trainable params: 0
_________________________________________________________________
Model: "critic_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
concatenate_1 (Concatenate)  multiple                  0         
_________________________________________________________________
cnn_6 (CNN)                  multiple                  6735444   
_________________________________________________________________
cnn_7 (CNN)                  multiple                  1604000   
_________________________________________________________________
cnn_8 (CNN)                  multiple                  320400    
_________________________________________________________________
cnn_9 (CNN)                  multiple                  97400     
_________________________________________________________________
cnn_10 (CNN)                 multiple                  24120     
_________________________________________________________________
cnn_11 (CNN)                 multiple                  7260      
_________________________________________________________________
cnn_12 (CNN)                 multiple                  549       
_________________________________________________________________
cnn_13 (CNN)                 multiple                  10        
=================================================================
Total params: 8,789,183
Trainable params: 8,789,183
Non-trainable params: 0
_________________________________________________________________
